The column is already attached. It will be detached and attached to the new target.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ColumnAlreadyAttachedWillBeReattached { get; }
  Visual Basic
Public Shared ReadOnly Property ColumnAlreadyAttachedWillBeReattached As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ColumnAlreadyAttachedWillBeReattached {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace